Ran Plan for project: `terraform-test` dir: `terraform/2-modules` workspace: `default`

<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-093b7895c0f11f648]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ec2-az1[0].aws_instance.this will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-093b7895c0f11f648"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1a-1"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                             = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1a-1"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2-az1[0].aws_route53_record.a[0] will be created
+ resource "aws_route53_record" "a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1a-1"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.ec2-az1[0].aws_route53_record.cname[0] will be created
+ resource "aws_route53_record" "cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1a-1-cname"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.ec2-az1[1].aws_instance.this will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-093b7895c0f11f648"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1a-2"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                             = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1a-2"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2-az1[1].aws_route53_record.a[0] will be created
+ resource "aws_route53_record" "a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1a-2"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.ec2-az1[1].aws_route53_record.cname[0] will be created
+ resource "aws_route53_record" "cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1a-2-cname"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.ec2-az2[0].aws_instance.this will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-093b7895c0f11f648"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1b-1"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                             = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1b-1"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2-az2[0].aws_route53_record.a[0] will be created
+ resource "aws_route53_record" "a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1b-1"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.ec2-az2[0].aws_route53_record.cname[0] will be created
+ resource "aws_route53_record" "cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1b-1-cname"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.ec2-az2[1].aws_instance.this will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-093b7895c0f11f648"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1b-2"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                             = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "server-eu-central-1b-2"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2-az2[1].aws_route53_record.a[0] will be created
+ resource "aws_route53_record" "a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1b-2"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.ec2-az2[1].aws_route53_record.cname[0] will be created
+ resource "aws_route53_record" "cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "server-eu-central-1b-2-cname"
      + records         = (known after apply)
      + ttl             = 1200
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.vpc.aws_route53_zone.private[0] will be created
+ resource "aws_route53_zone" "private" {
      + arn           = (known after apply)
      + comment       = "Created by aws-vpc module"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "dev.terraform-modules.devops-iac-report.local"
      + name_servers  = (known after apply)
      + tags          = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all      = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # module.vpc.aws_subnet.private["devops-iac-report-terraform-modules-dev-eu-central-1a"] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.27.226.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "devops-iac-report-terraform-modules-dev-eu-central-1a"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                                       = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "devops-iac-report-terraform-modules-dev-eu-central-1a"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private["devops-iac-report-terraform-modules-dev-eu-central-1b"] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.27.227.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "devops-iac-report-terraform-modules-dev-eu-central-1b"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                                       = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "devops-iac-report-terraform-modules-dev-eu-central-1b"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+ resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.27.226.0/23"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "devops-iac-report-terraform-modules-dev"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
      + tags_all                             = {
          + "App"         = "terraform-modules"
          + "Environment" = "dev"
          + "Managed_by"  = "Terraform"
          + "Name"        = "devops-iac-report-terraform-modules-dev"
          + "Owner"       = "andrei.romanov"
          + "Project"     = "devops-iac-report"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-test`
* :put_litter_in_its_place: To **delete** this plan click [here](https://692e-79-137-165-138.eu.ngrok.io/lock?id=ansromanov%252Fcloud-iac-examples%252Fterraform%252F2-modules%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-test`
</details>
Plan: 16 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
